Repository: pittnerf/language_rally
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Generating examples...
hu: Példák generálása...

source: Error analyzing text
hu: Hiba a szöveg elemzése során

source: Warning
hu: Figyelmeztetés

# textIsVeryLarge
source: The text is very large
hu: A szöveg nagyon hosszú

source: words
hu: szó

# continueAnalysis
source: This may take longer to process and will be analyzed in chunks. Do you want to continue
hu: Az elemzés hosszabb időt vehet igénybe és részletekben lesz feldolgozva. Folytatja

# continueLabel
source: Continue
hu: Folytatás

# exportBeforeDeleteMessage
source: Would you like to export this package before deleting it? This will save all your data to a ZIP file.
hu: Szeretnéd exportálni ezt a csomagot a törlés előtt? Ez minden adatot menteni fog egy ZIP fájlba.

source: Delete Without Export
hu: Törlés Exportálás Nélkül

source: Export and Delete
hu: Exportálás és Törlés

source: Exporting package...
hu: Csomag exportálása...

source: Package exported to: {path}
hu: Csomag exportálva ide: {path}

# errorLoadingItems
source: Error loading items: {error}
hu: Hiba az elemek betöltésekor: {error}

# badgeEarnedWithName
source: Badge Earned: {badgeName}!
hu: Jelvény Megszerzve: {badgeName}!

# badgeLostWithName
source: Badge Lost: {badgeName}
hu: Jelvény Elveszítve: {badgeName}

source: Speak text
hu: Szöveg felolvasása

source: Training Session Progress
hu: Gyakorlás Előrehaladása

source: Total
hu: Összesen

# errorLoadingSettings
source: Error loading settings: {error}
hu: Hiba a beállítások betöltésekor: {error}

source: Select Package
hu: Csomag Kiválasztása

source: No packages available
hu: Nincsenek elérhető csomagok

source: Possible Solutions
hu: Lehetséges Megoldások

source: Technical Details
hu: Technikai Részletek

# checkApiKey
source: Check your OpenAI API key
hu: Ellenőrizd az OpenAI API kulcsot

# ensureValidOpenAIKey
source: Ensure the API key is valid and active
hu: Győződj meg róla, hogy az API kulcs érvényes és aktív

# verifyKeyInSettings
source: Verify the key in Settings
hu: Ellenőrizd a kulcsot a Beállításokban

# rateLimitExceeded
source: API rate limit exceeded
hu: API használati korlát túllépve

# waitAndRetry
source: Wait a few minutes and try again
hu: Várj néhány percet és próbáld újra

# checkAccountQuota
source: Check your OpenAI account quota
hu: Ellenőrizd az OpenAI fiók kvótáját

# invalidRequest
source: Invalid request format
hu: Érvénytelen kérés formátum

# tryReducingTextLength
source: Try reducing the text length
hu: Próbáld meg csökkenteni a szöveg hosszát

# checkTextFormat
source: Check that the text format is correct
hu: Ellenőrizd, hogy a szöveg formátuma helyes-e

# checkInternetConnection
source: Check your internet connection
hu: Ellenőrizd az internet kapcsolatot

# retryInMoment
source: Retry in a moment
hu: Próbáld újra egy pillanat múlva

# checkFirewall
source: Check firewall settings
hu: Ellenőrizd a tűzfal beállításokat

source: Text may be too short
hu: A szöveg túl rövid lehet

# tryDifferentKnowledgeLevel
source: Try a different knowledge level
hu: Próbálj ki egy másik tudásszintet

# ensureTextInCorrectLanguage
source: Ensure text is in the correct language
hu: Győződj meg róla, hogy a szöveg a megfelelő nyelven van

source: Request timed out
hu: A kérés időtúllépés miatt megszakadt

source: Text may be too long
hu: A szöveg túl hosszú lehet

# tryAgainOrReduceSize
source: Try again or reduce text size
hu: Próbáld újra vagy csökkentsd a szöveg méretét

# unexpectedError
source: An unexpected error occurred
hu: Váratlan hiba történt

# checkErrorDetails
source: Check error details below
hu: Nézd meg a hiba részleteit alább

source: Try again later
hu: Próbáld újra később

source: Translation service failed
hu: A fordítási szolgáltatás hibát jelzett

# checkApiKeys
source: Check your API keys (DeepL, OpenAI)
hu: Ellenőrizd az API kulcsokat (DeepL, OpenAI)

# retryImport
source: Retry the import
hu: Próbáld újra az importálást

source: Example generation failed
hu: A példamondatok generálása sikertelen

# itemsStillImported
source: Items were still imported
hu: Az elemek ettől függetlenül importálva lettek

# canAddExamplesManually
source: You can add examples manually later
hu: Később manuálisan is hozzáadhatsz példákat

# databaseError
source: Database error occurred
hu: Adatbázis hiba történt

# checkStorageSpace
source: Check available storage space
hu: Ellenőrizd a rendelkezésre álló tárhelyet

# restartApp
source: Try restarting the app
hu: Próbáld újraindítani az alkalmazást
