Repository: pittnerf/language_rally
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Hello World!
hu: Helló Világ!

# welcome
source: Welcome to Language Rally
hu: Isten hozott a Language Rally-ban

source: Create Package
hu: Csomag létrehozása

source: Edit Package
hu: Csomag szerkesztése

source: Package Details
hu: Csomag részletei

# languageCode1
source: Source Language Code
hu: Forrás nyelv kódja

# languageName1
source: Source Language Name
hu: Forrás nyelv neve

# languageCode2
source: Target Language Code
hu: Cél nyelv kódja

# languageName2
source: Target Language Name
hu: Cél nyelv neve

source: Description
hu: Leírás

# descriptionHint
source: Brief description of this language package
hu: Rövid leírás a nyelvi csomagról

source: Author Name
hu: Szerző neve

source: Author Email
hu: Szerző e-mail címe

source: Author Webpage
hu: Szerző weboldala

source: Version
hu: Verzió

source: items
hu: elem

source: Package Icon
hu: Csomag ikon

source: Package Group
hu: Csoport

source: Select Icon
hu: Ikon kiválasztása

source: Default Icon
hu: Alapértelmezett ikon

source: Custom Icon
hu: Egyéni ikon

# upload
source: Upload icon
hu: Ikon feltöltése

# uploadCustomIcon
source: Upload Custom Icon (max 512x512, 1MB)
hu: Egyéni ikon feltöltése (max 512x512, 1MB)

# customIconUploaded
source: Custom icon uploaded successfully
hu: Egyéni ikon sikeresen feltöltve

source: Save
hu: Mentés

source: Cancel
hu: Mégse

source: Delete
hu: Törlés

# confirmDelete
source: Are you sure you want to delete this package?
hu: Biztosan törölni szeretné ezt a csomagot?

# packageSaved
source: Package saved successfully
hu: Csomag sikeresen mentve

# packageDeleted
source: Package deleted successfully
hu: Csomag sikeresen törölve

source: Error saving package
hu: Hiba a csomag mentése során

source: Error deleting package
hu: Hiba a csomag törlése során

# fieldRequired
source: This field is required
hu: Ez a mező kötelező

# invalidEmail
source: Invalid email address
hu: Érvénytelen e-mail cím

source: Invalid URL
hu: Érvénytelen URL

# readOnlyPackage
source: This package is read-only and cannot be edited
hu: Ez a csomag csak olvasható és nem szerkeszthető

# purchasedPackage
source: Purchased packages cannot be edited
hu: A megvásárolt csomagok nem szerkeszthetők

source: Badges
hu: Jelvények

# noBadges
source: No badges earned yet
hu: Még nincs megszerzett jelvény

source: Select Language Code
hu: Nyelvkód kiválasztása

source: Clear Counters
hu: Számlálók törlése

# confirmClearCounters
source: Are you sure you want to clear all training counters for this package? This will reset the 'don't know' counters and training statistics.
hu: Biztosan törölni szeretné az összes gyakorlásii számlálót ebből a csomagból? Ez visszaállítja a 'nem tudom' számlálókat és a gyakorlási statisztikákat.

source: Clear
hu: Törlés

# countersCleared
source: Counters cleared successfully
hu: Számlálók sikeresen törölve

source: Error clearing counters
hu: Hiba a számlálók törlése során

# deleteAll
source: Delete Package
hu: Csomag törlése

# confirmDeleteAllData
source: Are you sure you want to delete this package with ALL its data? This will permanently delete all categories, items, and training statistics. This action cannot be undone!
hu: Biztosan törölni szeretné ezt a csomagot az ÖSSZES adatával? Ez véglegesen törli az összes kategóriát, elemet és gyakorlási statisztikát. Ez a művelet nem vonható vissza!

# allDataDeleted
source: Package and all data deleted successfully
hu: Csomag és minden adat sikeresen törölve

source: Export Package
hu: Csomag exportálása

source: Select Export Location
hu: Exportálási hely kiválasztása

# packageExported
source: Package exported successfully
hu: Csomag sikeresen exportálva

source: Error exporting package
hu: Hiba a csomag exportálása során

source: Import Items
hu: Elemek importálása

source: Select Import File
hu: Importálandó fájl kiválasztása

source: Import Format
hu: Importálási formátum

# importFormatDescription
source: Import items from a text file. Each line should contain an item in the following format:
hu: Elemek importálása szöveges fájlból. Minden sor egy elemet tartalmaz a következő formátumban:

source: Import Results
hu: Importálási eredmények

source: Successfully imported
hu: Sikeresen importálva

source: Failed to import
hu: Importálás sikertelen

source: Error importing items
hu: Hiba az elemek importálása során

source: Error
hu: Hiba

source: Close
hu: Bezárás

source: Import Package
hu: Csomag importálása

# importPackageTooltip
source: Import package from ZIP file
hu: Csomag importálása ZIP fájlból

source: Select Package ZIP File
hu: Válasszon csomag ZIP fájlt

# couldNotAccessFile
source: Could not access the selected file.
hu: A kiválasztott fájl nem érhető el.

source: Importing package...
hu: Csomag importálása...

source: Package imported successfully!
hu: Csomag sikeresen importálva!

# packageImportedWithItems
source: Package imported successfully! ({count} items)
hu: Csomag sikeresen importálva! ({count} elem)

# packageImportedWithGroup
source: Package imported to "{groupName}" group! ({count} items)
hu: Csomag importálva a "{groupName}" csoportba! ({count} elem)

source: Import Error
hu: Importálási hiba

source: Failed to import package
hu: Nem sikerült a csomag importálása

source: Package already exists
hu: A csomag már létezik

# packageExistsMessage
source: A package with the same language pair, description, author information, and version already exists in the "{groupName}" group. Would you like to import it as a new package anyway?
hu: Már létezik egy csomag ugyanezzel a nyelvpárral, leírással, szerző információval és verzióval. Szeretné mindenképpen új csomagként importálni?

# importAsNew
source: Import Anyway
hu: Importálás mindenképpen

source: ZIP file not found
hu: ZIP fájl nem található

# invalidPackageZip
source: Invalid package ZIP: missing package_data.json
hu: Érvénytelen csomag ZIP: hiányzik a package_data.json

# invalidPackageFormat
source: Invalid package file format
hu: Érvénytelen csomag fájlformátum

source: Language Packages
hu: Nyelvi csomagok

source: Loading packages...
hu: Csomagok betöltése...

# tapAndHoldToReorder
source: Tap and hold to reorder cards
hu: Érintse meg és tartsa lenyomva az átrendezéshez

# tapAndHoldToReorderList
source: Tap and hold ≡ to reorder • Tap ⋮ to toggle compact view
hu: Érintse meg és tartsa ≡ az átrendezéshez • Érintse ⋮ a kompakt nézethez

source: No packages yet
hu: Még nincs csomag

# createFirstPackage
source: Create your first language package
hu: Hozza létre az első nyelvi csomagját

# versionLabel
source: Version
hu: Verzió

source: Purchased
hu: Megvásárolt

source: Compact view
hu: Kompakt nézet

source: Expand
hu: Kibontás

source: All Categories
hu: Összes kategória

# categoriesInPackage
source: Categories in this package
hu: Kategóriák ebben a csomagban

source: Categories
hu: Kategóriák

source: Test Inter Fonts
hu: Inter betűtípusok tesztelése

source: View Packages
hu: Csomagok megtekintése

source: Create New Package
hu: Új csomag létrehozása

source: Generate Test Data
hu: Teszt adatok generálása

source: Design System Showcase
hu: Designrendszer bemutató

source: Badge Earned!
hu: Jelvény megszerzése!

source: Achievement
hu: Teljesítmény

source: Awesome!
hu: Remek!

# importFormatNotes
source: Notes:
hu: Megjegyzések:

# importFormatLine1
source: • Each line represents one item
hu: • Minden sor egy elemet képvisel

# importFormatLine2
source: • Fields are separated by |
hu: • A mezőket | karakter választja el

# importFormatLine3
source: • Categories are separated by ;
hu: • A kategóriákat ; karakter választja el

# importFormatLine4
source: • The last | is optional
hu: • Az utolsó | opcionális

# importFormatLine5
source: • Empty lines are ignored
hu: • Az üres sorok figyelmen kívül maradnak

# importFormatLine6
source: • Duplicates are skipped
hu: • A duplikátumok kihagyásra kerülnek

# importProgress
source: Importing {current} of {total}
hu: {current} / {total} importálása

# importFormatNewDescription
source: Import items from a text file. Each line should contain an item with fields separated by ---
hu: Elemek importálása szöveges fájlból. Minden sor egy elemet tartalmaz, a mezőket --- választja el

# importFormatNewLine1
source: • Main delimiter: ---
hu: • Fő elválasztó: ---

# importFormatNewLine2
source: • L1=<text> - Language 1 main text (required if L2 is missing)
hu: • L1=<szöveg> - 1. nyelv fő szövege (kötelező, ha L2 hiányzik)

# importFormatNewLine3
source: • L2=<text> - Language 2 main text (required if L1 is missing)
hu: • L2=<szöveg> - 2. nyelv fő szövege (kötelező, ha L1 hiányzik)

# importFormatNewLine4
source: • L1pre=<text> - Language 1 prefix (optional)
hu: • L1pre=<szöveg> - 1. nyelv előtag (opcionális)

# importFormatNewLine5
source: • L1post=<text> - Language 1 suffix (optional)
hu: • L1post=<szöveg> - 1. nyelv utótag (opcionális)

# importFormatNewLine6
source: • L2pre=<text> - Language 2 prefix (optional)
hu: • L2pre=<szöveg> - 2. nyelv előtag (opcionális)

# importFormatNewLine7
source: • L2post=<text> - Language 2 suffix (optional)
hu: • L2post=<szöveg> - 2. nyelv utótag (opcionális)

# importFormatNewLine8
source: • EX=<L1 text>:::<L2 text> - Example (optional, can be multiple)
hu: • EX=<L1 szöveg>:::<L2 szöveg> - Példa (opcionális, többször is szerepelhet)

# importFormatNewLine9
source: • CAT=<cat1>:::<cat2>:::<cat3> - Categories (optional)
hu: • CAT=<kat1>:::<kat2>:::<kat3> - Kategóriák (opcionális)

# importFormatNewLine10
source: • At least one of L1= or L2= must be present
hu: • Legalább az L1= vagy az L2= kötelező

# importFormatNewLine11
source: • Empty lines are ignored
hu: • Az üres sorok figyelmen kívül maradnak

# importFormatNewLine12
source: • Duplicates are skipped
hu: • A duplikátumok kihagyásra kerülnek

# invalidImportLine
source: Invalid line
hu: Érvénytelen sor

# missingRequiredFields
source: Missing 'L1=' vagy 'L2='
hu: Hiányzik 'L1=' vagy 'L2='

# unknownField
source: Unknown field prefix
hu: Ismeretlen mező előtag

# andMore
source: ... and {count} more
hu: ... és még {count}

source: Browse Items
hu: Elemek böngészése

# itemDetails
source: Details
hu: Részletek

source: Filter Items
hu: Elemek szűrése

# searchLanguage1
source: Search in {language}
hu: Keresés ebben: {language}

# searchLanguage2
source: Search in {language}
hu: Keresés ebben: {language}

source: Case sensitive
hu: Kis- és nagybetű érzékeny

source: Known status
hu: Tudás állapota

source: All items
hu: Minden elem

source: Items I knew
hu: Elemek, amiket tudtam

source: Items I did not know
hu: Elemek, amiket nem tudtam

source: Known
hu: Tudom

source: Important
hu: Fontos

source: Favourite
hu: Kedvenc

source: Examples
hu: Példamondatok

# examplesHint
source: Enter example sentences (one per line, use | to separate languages)
hu: Írj be példamondatokat (soronként egyet, használj | jelet a nyelvek elválasztására)

# noExamples
source: No examples available
hu: Nincsenek elérhető példamondatok

source: Pronounce
hu: Kiejtés

# ttsError
source: Text-to-speech not available
hu: Szövegfelolvasás nem elérhető

source: No items found
hu: Nem található elem

# noItemsInPackage
source: No items in this package yet
hu: Még nincs elem ebben a csomagban

source: Clear Filters
hu: Szűrők törlése

# itemCount
source: {count} items
hu: {count} elem

# filteredItemCount
source: {filtered} of {total} items
hu: {filtered} / {total} elem

source: Training Rally
hu: Gyakorlás

source: Start Training
hu: Gyakorlás kezdése

# trainingComingSoon
source: Training Rally - Coming Soon!
hu: Gyakorlás - Hamarosan!

# aiServiceNotConfigured
source: AI service not configured. Please add your OpenAI API key.
hu: AI szolgáltatás nincs konfigurálva. Kérlek, add meg az OpenAI API kulcsot.

source: Please enter text in {language} first
hu: Kérlek, először adj meg szöveget {language} nyelven

# translationCompletedSuccessfully
source: Translation completed successfully using {service}!
hu: Fordítás sikeresen elkészült ({service})!

source: Translation failed
hu: Fordítás sikertelen

# addedExamplesSuccessfully
source: Added {count} example(s) successfully!
hu: {count} példa sikeresen hozzáadva!

source: Failed to generate examples
hu: Példák generálása sikertelen

source: Select Examples to Add
hu: Példák kiválasztása

# selectWhichExamples
source: Select which examples you want to add to this item:
hu: Válaszd ki, melyik példákat szeretnéd hozzáadni:

source: Deselect All
hu: Összes kijelölés törlése

source: Select All
hu: Összes kijelölése

source: Add Selected
hu: Kijelöltek hozzáadása

# pleaseSelectAtLeastOne
source: Please select at least one example
hu: Kérlek, válassz ki legalább egy példát

source: Add New Item
hu: Új elem hozzáadása

source: Edit Item
hu: Elem szerkesztése

source: Delete Item
hu: Elem törlése

# confirmDeleteItem
source: Are you sure you want to delete this item?
hu: Biztosan törölni szeretnéd ezt az elemet?

source: This action cannot be undone.
hu: Ez a művelet nem vonható vissza.

source: Item deleted
hu: Elem törölve

source: Error deleting item
hu: Hiba az elem törlésekor

source: Error saving item
hu: Hiba az elem mentésekor

# itemSaved
source: Item updated successfully
hu: Elem sikeresen frissítve

# itemCreated
source: Item created successfully
hu: Elem sikeresen létrehozva

source: Pre-text (optional)
hu: Elő-szöveg (opcionális)

source: Main text
hu: Fő szöveg

source: Post-text (optional)
hu: Utó-szöveg (opcionális)

# forExampleToForVerbs
source: e.g., "to" for verbs
hu: pl. "to" igéknél angolul

source: Additional context
hu: További kontextus

source: Translate
hu: Fordítás

source: Translate {from} → {to}
hu: Fordítás {from} → {to}

source: AI Example Generation
hu: AI példa generálás

source: AI Example Search
hu: AI példa keresés

# searchExamplesOnInternet
source: Search for example sentences on the internet using AI for '{text}'
hu: Példamondatok keresése az interneten AI segítségével ehhez: '{text}'

# generateExampleSentences
source: Generate example sentences based on the main text in {language}
hu: Példamondatok generálása a fő szöveg alapján ({language})

source: Generate Examples
hu: Példák generálása

source: Voice input
hu: Hangbemenet

source: Settings
hu: Beállítások

source: UI Language
hu: Felület Nyelve

# uiLanguageDescription
source: Application interface language
hu: Az alkalmazás felületének nyelve

# uiLanguageHelper
source: Select the language for menus, buttons, and labels
hu: Válaszd ki a menük, gombok és címkék nyelvét

source: User Language
hu: Felhasználói nyelv

# userLanguageDescription
source: Your preferred mother tongue for creating new language packages
hu: A nyilvi csomagok létrehozásánál preferált anyanyelv

source: API Keys
hu: API kulcsok

source: DeepL API Key
hu: DeepL API kulcs

# deeplApiKeyDescription
source: For premium translation quality when editing language items (optional)
hu: Prémium fordítási minőséghez a tételek szerkesztésénél (opcionális)

source: OpenAI API Key
hu: OpenAI API kulcs

# openaiApiKeyDescription
source: For example generation with AI when editing language items (optional)
hu: Jó minőségű példák generáláshoz AI segítségével (opcionális)

source: Enter API key
hu: API kulcs megadása

source: optional
hu: opcionális

source: required
hu: kötelező

# settingsSaved
source: Settings saved successfully
hu: Beállítások sikeresen mentve

source: Error saving settings
hu: Hiba a beállítások mentésekor

# usingGoogleTranslate
source: Using free Google Translate
hu: Ingyenes Google Fordító használata

# usingDeepL
source: Using DeepL (premium)
hu: DeepL használata (prémium)

source: Text cannot be empty
hu: A szöveg nem lehet üres

source: No translation received from Google
hu: Nem érkezett fordítás a Google-től

source: Google translation failed
hu: Google fordítás sikertelen

source: Google translation error
hu: Google fordítási hiba

source: No translation received from DeepL
hu: Nem érkezett fordítás a DeepL-től

source: Invalid DeepL API key
hu: Érvénytelen DeepL API kulcs

source: DeepL translation quota exceeded
hu: DeepL fordítási kvóta túllépve

source: DeepL translation failed
hu: DeepL fordítás sikertelen

source: DeepL translation error
hu: DeepL fordítási hiba

# invalidApiKeyConfigureOpenAI
source: Invalid API key. Please configure your OpenAI API key.
hu: Érvénytelen API kulcs. Kérlek, konfiguráld az OpenAI API kulcsot.

# apiRateLimitExceeded
source: API rate limit exceeded. Please try again later.
hu: API sebesség limit túllépve. Kérlek, próbáld újra később.

source: AI request failed
hu: AI kérés sikertelen

# failedToParseAiResponse
source: Failed to parse AI response. Please try again.
hu: AI válasz feldolgozása sikertelen. Kérlek, próbáld újra.

source: AI generation error
hu: AI generálási hiba

# voiceInputPlaceholder
source: Voice input will be implemented using speech_to_text package
hu: Hangbemenet a speech_to_text csomag használatával lesz megvalósítva

# improveQualityWithApiKeys
source: 💡 Tip: The quality of translations and example searches can be significantly improved by adding your DeepL and OpenAI API keys in the application settings.
hu: 💡 Tipp: A fordítások és példakeresések minősége jelentősen javítható a DeepL és OpenAI API kulcsok megadásával az alkalmazás beállításokban.

# noApiKeyFallbackMessage
source: Without API keys, basic translation and limited examples are provided. For best results, configure your API keys in Settings.
hu: API kulcsok nélkül alapszintű fordítás és korlátozott példák érhetők el. A legjobb eredményekhez állítsd be az API kulcsokat a Beállításokban.

# listeningForSpeech
source: Listening... Speak now
hu: Figyelek... Beszélj most

# speechRecognitionNotAvailable
source: Speech recognition is not available on this device
hu: Beszédfelismerés nem elérhető ezen az eszközön

# speechRecognitionPermissionDenied
source: Speech recognition permission was denied
hu: Beszédfelismerési engedély megtagadva

source: Speech recognition error
hu: Beszédfelismerési hiba

# tapToSpeak
source: Tap microphone to speak
hu: Koppints a mikrofonra a beszédhez

# speechNotRecognized
source: No speech was recognized. Please try again.
hu: Nem sikerült felismerni a beszédet. Kérlek, próbáld újra.

source: Training Settings
hu: Gyakorlási Beállítások

source: Item Scope
hu: Elemek Köre

source: Last N items
hu: Utolsó N elem

# onlyUnknown
source: Only unknown items
hu: Csak ismeretlen elemek

# onlyImportant
source: Only important items
hu: Csak fontos elemek

# onlyFavourite
source: Only favourite items
hu: Csak kedvenc elemek

source: Number of Items
hu: Elemek Száma

source: Item Order
hu: Elemek Sorrendje

source: Random order
hu: Véletlenszerű sorrend

source: Sequential order
hu: Szekvenciális sorrend

source: Display Language
hu: Megjelenítési Nyelv

source: Mother tongue
hu: Anyanyelv

source: Target language
hu: Célnyelv

# randomLanguage
source: Random
hu: Véletlenszerű

source: Category Filter
hu: Kategória Szűrő

# categoryFilterHint
source: Select categories to include (empty = all categories)
hu: Válaszd ki a kategóriákat (üres = minden kategória)

# noCategories
source: No categories available
hu: Nincsenek elérhető kategóriák

source: Don't Know Threshold
hu: Nem Tudom Küszöb

# dontKnowThresholdHint
source: Number of times an item needs to be marked as 'don't know' before special handling
hu: Hányszor kell 'nem tudom'-nak jelölni egy elemet a speciális kezeléshez

source: Start Training Rally
hu: Gyakorlási Rally Indítása

# clearTrainingSettings
source: Clear Settings
hu: Beállítások Törlése

# confirmClearTrainingSettings
source: Are you sure you want to reset all training settings to default values?
hu: Biztosan visszaállítod az összes gyakorlási beállítást az alapértelmezett értékekre?

# trainingSettingsCleared
source: Training settings have been cleared
hu: A gyakorlási beállítások törölve lettek

source: Starting training...
hu: Gyakorlás indítása...

# noMoreItemsToDisplay
source: No more items to display based on your filter settings.
hu: Nincs több megjelenítendő elem a szűrési beállítások alapján.

source: No Items
hu: Nincs Elem

source: Training Complete
hu: Gyakorlás Befejezve

# allItemsCompleted
source: Congratulations! You have completed all items in this training session.
hu: Gratulálunk! Befejezted az összes elemet ebben a gyakorlásban.

source: Close Training
hu: Gyakorlás Bezárása

# confirmCloseTraining
source: Are you sure you want to close the training? Your progress has been saved.
hu: Biztosan bezárod a gyakorlást? A folyamatod mentve lett.

source: Question
hu: Kérdés

source: Answer
hu: Válasz

source: I Know
hu: Tudom

source: I Don't Know
hu: Nem Tudom

source: Next Item
hu: Következő Elem

# iDidNotKnowEither
source: I Didn't Know Either
hu: Ezt Sem Tudtam

# exportBeforeDelete
source: Export Before Deleting?
hu: Exportálja törlés előtt?

# aiTextAnalysis
source: Import with AI
hu: AI Szövegelemzés

# aiTextAnalysisImport
source: Import with AI Text Analysis
hu: AI Szövegelemzés Import

source: Knowledge Level
hu: Tudásszint

source: A1 - Beginner
hu: A1 - Kezdő

source: A2 - Elementary
hu: A2 - Alapszint

source: B1 - Intermediate
hu: B1 - Középhaladó

source: B2 - Upper Intermediate
hu: B2 - Felső középhaladó

source: C1 - Advanced
hu: C1 - Haladó

source: C2 - Proficient
hu: C2 - Felsőfokú

# pasteTextHere
source: Paste your text here...
hu: Illessze be ide a szöveget...

source: Extract Words
hu: Szavak kinyerése

source: Extract Expressions
hu: Kifejezések kinyerése

# maxItems
source: Maximum Items
hu: Maximum elemszám

# maxItemsHint
source: Leave empty for no limit
hu: Hagyja üresen korlát nélkül

source: Category Name
hu: Kategória neve

# categoryNameHint
source: Name for imported items category
hu: Név az importált elemek kategóriájához

source: Analyze Text
hu: Szöveg elemzése

source: Configure Analysis
hu: Elemzés Beállítása

# openaiModel
source: AI Model
hu: AI Modell

# openaiModelDescription
source: Select ChatGPT model
hu: ChatGPT modell kiválasztása

# modelGpt35TurboDesc
source: Fast and cost-effective; standard for production
hu: Gyors és költséghatékony; általános használatra

# modelGpt35Turbo16kDesc
source: Same as GPT-3.5, but 16K token context window
hu: Mint a GPT-3.5, de 16K token kontextusablakkal

# modelGpt4Desc
source: Higher accuracy/reasoning; slower and more expensive
hu: Magasabb pontosság/érvelés; lassabb és drágább

# modelGpt4TurboDesc
source: Faster, cheaper, high accuracy; improved context
hu: Gyorsabb, olcsóbb, magas pontosság; jobb kontextus

source: Analyzing...
hu: Elemzés folyamatban...

source: Language Detected
hu: Észlelt nyelv

source: Items Found
hu: Talált elemek

source: Select Items to Import
hu: Válassza ki az importálandó elemeket

source: Import Selected
hu: Kijelöltek importálása

source: Importing...
hu: Importálás...

# itemsImported
source: Items imported successfully
hu: Elemek sikeresen importálva

source: No items selected
hu: Nincs elem kijelölve

# selectAtLeastOneType
source: Select at least one type (words or expressions)
hu: Válasszon ki legalább egy típust (szavak vagy kifejezések)

# languageNotMatching
source: The detected language does not match any language in the package
hu: Az észlelt nyelv nem egyezik a csomag egyik nyelvével sem

# openaiKeyRequired
source: OpenAI API key is required for this feature
hu: OpenAI API kulcs szükséges ehhez a funkcióhoz

# analyzingProgress
source: Analyzing: {current} / {total}
hu: Elemzés: {current} / {total}

# translatingProgress
source: Translating: {current} / {total}
hu: Fordítás: {current} / {total}

source: Duplicate
hu: Duplikátum

source: Detecting language...
hu: Nyelv felismerése...

source: Extracting items...
hu: Elemek kinyerése...

# checkingDuplicates
source: Checking for duplicates...
hu: Duplikátumok ellenőrzése...

source: Translating...
hu: Fordítás...
